# Ultralytics YOLO 🚀, GPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.67, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, X3Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, X3Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, X3C2f, [128, True]]
  - [-1, 1, X3Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, X3C2f, [256, True]]
  - [-1, 1, X3Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, X3C2f, [512, True]]
  - [-1, 1, X3Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, X3C2f, [1024, True]]
  - [-1, 1, X3SPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, X3ConvTranspose, [512]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, X3C2f, [512]]  # 13

  - [-1, 1, X3ConvTranspose, [256]]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, X3C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, X3Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, X3C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, X3Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, X3C2f, [1024]]  # 23 (P5/32-large)

  - [[15, 18, 21], 1, X3Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
